smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*******************************************************************************
 * HW_AIPS_PACRF - Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief HW_AIPS_PACRF - Peripheral Access Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This section describes PACR registers E-P, which control peripheral slots
 * 32-127. See PACRPeripheral Access Control Register for the description of these
 * registers.
 */
typedef union _hw_aips_pacrf
{
    uint32_t U;
    struct _hw_aips_pacrf_bitfields
    {
        uint32_t TP7 : 1;              /*!< [0] Trusted Protect */
        uint32_t WP7 : 1;              /*!< [1] Write Protect */
        uint32_t SP7 : 1;              /*!< [2] Supervisor Protect */
        uint32_t RESERVED0 : 1;        /*!< [3]  */
        uint32_t TP6 : 1;              /*!< [4] Trusted Protect */
        uint32_t WP6 : 1;              /*!< [5] Write Protect */
        uint32_t SP6 : 1;              /*!< [6] Supervisor Protect */
        uint32_t RESERVED1 : 1;        /*!< [7]  */
        uint32_t TP5 : 1;              /*!< [8] Trusted Protect */
        uint32_t WP5 : 1;              /*!< [9] Write Protect */
        uint32_t SP5 : 1;              /*!< [10] Supervisor Protect */
        uint32_t RESERVED2 : 1;        /*!< [11]  */
        uint32_t TP4 : 1;              /*!< [12] Trusted Protect */
        uint32_t WP4 : 1;              /*!< [13] Write Protect */
        uint32_t SP4 : 1;              /*!< [14] Supervisor Protect */
        uint32_t RESERVED3 : 1;        /*!< [15]  */
        uint32_t TP3 : 1;              /*!< [16] Trusted Protect */
        uint32_t WP3 : 1;              /*!< [17] Write Protect */
        uint32_t SP3 : 1;              /*!< [18] Supervisor Protect */
        uint32_t RESERVED4 : 1;        /*!< [19]  */
        uint32_t TP2 : 1;              /*!< [20] Trusted Protect */
        uint32_t WP2 : 1;              /*!< [21] Write Protect */
        uint32_t SP2 : 1;              /*!< [22] Supervisor Protect */
        uint32_t RESERVED5 : 1;        /*!< [23]  */
        uint32_t TP1 : 1;              /*!< [24] Trusted Protect */
        uint32_t WP1 : 1;              /*!< [25] Write Protect */
        uint32_t SP1 : 1;              /*!< [26] Supervisor Protect */
        uint32_t RESERVED6 : 1;        /*!< [27]  */
        uint32_t TP0 : 1;              /*!< [28] Trusted Protect */
        uint32_t WP0 : 1;              /*!< [29] Write Protect */
        uint32_t SP0 : 1;              /*!< [30] Supervisor Protect */
        uint32_t RESERVED7 : 1;        /*!< [31]  */
    } B;
} hw_aips_pacrf_t;

/*!
 * @name Constants and macros for entire AIPS_PACRF register
 */
/*@{*/
#define HW_AIPS_PACRF_ADDR(x)    ((uintptr_t)(x) + 0x44U)

#define HW_AIPS_PACRF(x)         (*(__IO hw_aips_pacrf_t *) HW_AIPS_PACRF_ADDR(x))
#define HW_AIPS_PACRF_RD(x)      (HW_AIPS_PACRF(x).U)
#define HW_AIPS_PACRF_WR(x, v)   (HW_AIPS_PACRF(x).U = (v))
#define HW_AIPS_PACRF_SET(x, v)  (HW_AIPS_PACRF_WR(x, HW_AIPS_PACRF_RD(x) |  (v)))
#define HW_AIPS_PACRF_CLR(x, v)  (HW_AIPS_PACRF_WR(x, HW_AIPS_PACRF_RD(x) & ~(v)))
#define HW_AIPS_PACRF_TOG(x, v)  (HW_AIPS_PACRF_WR(x, HW_AIPS_PACRF_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual AIPS_PACRF bitfields
 */

/*!
 * @name Register AIPS_PACRF, field TP7[0] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0 - Accesses from an untrusted master are allowed.
 * - 1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
#define BP_AIPS_PACRF_TP7    (0U)          /*!< Bit position for AIPS_PACRF_TP7. */
#define BM_AIPS_PACRF_TP7    (0x00000001U) /*!< Bit mask for AIPS_PACRF_TP7. */
#define BS_AIPS_PACRF_TP7    (1U)          /*!< Bit field size in bits for AIPS_PACRF_TP7. */

/*! @brief Read current value of the AIPS_PACRF_TP7 field. */
#define BR_AIPS_PACRF_TP7(x) (BITBAND_ACCESS32(HW_AIPS_PACRF_ADDR(x), BP_AIPS_PACRF_TP7))

/*! @brief Format value for bitfield AIPS_PACRF_TP7. */
#define BF_AIPS_PACRF_TP7(v) ((uint32_t)((uint32_t)(v) << BP_AIPS_PACRF_TP7) & BM_AIPS_PACRF_TP7)

/*! @brief Set the TP7 field to a new value. */
#define BW_AIPS_PACRF_TP7(x, v) (BITBAND_ACCESS32(HW_AIPS_PACRF_ADDR(x), BP_AIPS_PACRF_TP7) = (v))
/*@}*/

/*!
 * @name Register AIPS_PACRF, field WP7[1] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0 - This peripheral allows write accesses.
 * - 1 - This peripheral is write protected.
 */
/*@{*/
#define BP_AIPS_PACRF_WP7    (1U)          /*!< Bit position for AIPS_PACRF_WP7. */
#define BM_AIPS_PACRF_WP7    (0x00000002U) /*!< Bit mask for AIPS_PACRF_WP7. */
#define BS_AIPS_PACRF_WP7    (1U)          /*!< Bit field size in bits for AIPS_PACRF_WP7. */

/*! @brief Read current value of the AIPS_PACRF_WP7 field. */
#define BR_AIPS_PACRF_WP7(x) (BITBAND_ACCESS32(HW_AIPS_PACRF_ADDR(x), BP_AIPS_PACRF_WP7))

/*! @brief Format value for bitfield AIPS_PACRF_WP7. */
#define BF_AIPS_PACRF_WP7(v) ((uint32_t)((uint32_t)(v) << BP_AIPS_PACRF_WP7) & BM_AIPS_PACRF_WP7)

/*! @brief Set the WP7 field to a new value. */
#define BW_AIPS_PACRF_WP7(x, v) (BITBAND_ACCESS32(HW_AIPS_PACRF_ADDR(x), BP_AIPS_PACRF_WP7) = (v))
/*@}*/

/*!
 * @name Register AIPS_PACRF, field SP7[2] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
#define BP_AIPS_PACRF_SP7    (2U)          /*!< Bit position for AIPS_PACRF_SP7. */
#define BM_AIPS_PACRF_SP7    (0x00000004U) /*!< Bit mask for AIPS_PACRF_SP7. */
#define BS_AIPS_PACRF_SP7    (1U)          /*!< Bit field size in bits for AIPS_PACRF_SP7. */

