smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*
 * Constants & macros for individual CAU_ADR_CA6 bitfields
 */

/*!
 * @name Register CAU_ADR_CA6, field CA6[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA6_CA6   (0U)          /*!< Bit position for CAU_ADR_CA6_CA6. */
#define BM_CAU_ADR_CA6_CA6   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA6_CA6. */
#define BS_CAU_ADR_CA6_CA6   (32U)         /*!< Bit field size in bits for CAU_ADR_CA6_CA6. */

/*! @brief Format value for bitfield CAU_ADR_CA6_CA6. */
#define BF_CAU_ADR_CA6_CA6(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA6_CA6) & BM_CAU_ADR_CA6_CA6)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA7 - General Purpose Register 7 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA7 - General Purpose Register 7 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca7
{
    uint32_t U;
    struct _hw_cau_adr_ca7_bitfields
    {
        uint32_t CA7 : 32;             /*!< [31:0] CA7 */
    } B;
} hw_cau_adr_ca7_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA7 register
 */
/*@{*/
#define HW_CAU_ADR_CA7_ADDR(x)   ((uintptr_t)(x) + 0x8E4U)

#define HW_CAU_ADR_CA7(x)        (*(__O hw_cau_adr_ca7_t *) HW_CAU_ADR_CA7_ADDR(x))
#define HW_CAU_ADR_CA7_WR(x, v)  (HW_CAU_ADR_CA7(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA7 bitfields
 */

/*!
 * @name Register CAU_ADR_CA7, field CA7[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA7_CA7   (0U)          /*!< Bit position for CAU_ADR_CA7_CA7. */
#define BM_CAU_ADR_CA7_CA7   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA7_CA7. */
#define BS_CAU_ADR_CA7_CA7   (32U)         /*!< Bit field size in bits for CAU_ADR_CA7_CA7. */

/*! @brief Format value for bitfield CAU_ADR_CA7_CA7. */
#define BF_CAU_ADR_CA7_CA7(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA7_CA7) & BM_CAU_ADR_CA7_CA7)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA8 - General Purpose Register 8 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA8 - General Purpose Register 8 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca8
{
    uint32_t U;
    struct _hw_cau_adr_ca8_bitfields
    {
        uint32_t CA8 : 32;             /*!< [31:0] CA8 */
    } B;
} hw_cau_adr_ca8_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA8 register
 */
/*@{*/
#define HW_CAU_ADR_CA8_ADDR(x)   ((uintptr_t)(x) + 0x8E8U)

#define HW_CAU_ADR_CA8(x)        (*(__O hw_cau_adr_ca8_t *) HW_CAU_ADR_CA8_ADDR(x))
#define HW_CAU_ADR_CA8_WR(x, v)  (HW_CAU_ADR_CA8(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA8 bitfields
 */

/*!
 * @name Register CAU_ADR_CA8, field CA8[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA8_CA8   (0U)          /*!< Bit position for CAU_ADR_CA8_CA8. */
#define BM_CAU_ADR_CA8_CA8   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA8_CA8. */
#define BS_CAU_ADR_CA8_CA8   (32U)         /*!< Bit field size in bits for CAU_ADR_CA8_CA8. */

/*! @brief Format value for bitfield CAU_ADR_CA8_CA8. */
#define BF_CAU_ADR_CA8_CA8(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA8_CA8) & BM_CAU_ADR_CA8_CA8)
/*@}*/

/*******************************************************************************
 * HW_CAU_RADR_CASR - Status register  - Reverse and Add to Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_RADR_CASR - Status register  - Reverse and Add to Register command (WO)
 *
 * Reset value: 0x20000000U
 */
typedef union _hw_cau_radr_casr
{
    uint32_t U;
    struct _hw_cau_radr_casr_bitfields
    {
        uint32_t IC : 1;               /*!< [0]  */
        uint32_t DPE : 1;              /*!< [1]  */
        uint32_t RESERVED0 : 26;       /*!< [27:2]  */
        uint32_t VER : 4;              /*!< [31:28] CAU version */
    } B;
} hw_cau_radr_casr_t;

/*!
 * @name Constants and macros for entire CAU_RADR_CASR register
 */
/*@{*/
#define HW_CAU_RADR_CASR_ADDR(x) ((uintptr_t)(x) + 0x900U)

#define HW_CAU_RADR_CASR(x)      (*(__O hw_cau_radr_casr_t *) HW_CAU_RADR_CASR_ADDR(x))
#define HW_CAU_RADR_CASR_WR(x, v) (HW_CAU_RADR_CASR(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_RADR_CASR bitfields
 */

/*!
 * @name Register CAU_RADR_CASR, field IC[0] (WO)
 *
 * Values:
 * - 0 - No illegal commands issued
 * - 1 - Illegal command issued
 */
/*@{*/
#define BP_CAU_RADR_CASR_IC  (0U)          /*!< Bit position for CAU_RADR_CASR_IC. */
#define BM_CAU_RADR_CASR_IC  (0x00000001U) /*!< Bit mask for CAU_RADR_CASR_IC. */
#define BS_CAU_RADR_CASR_IC  (1U)          /*!< Bit field size in bits for CAU_RADR_CASR_IC. */

/*! @brief Format value for bitfield CAU_RADR_CASR_IC. */
#define BF_CAU_RADR_CASR_IC(v) ((uint32_t)((uint32_t)(v) << BP_CAU_RADR_CASR_IC) & BM_CAU_RADR_CASR_IC)
/*@}*/

/*!
 * @name Register CAU_RADR_CASR, field DPE[1] (WO)
 *
 * Values:
 * - 0 - No error detected
 * - 1 - DES key parity error detected
 */
/*@{*/
#define BP_CAU_RADR_CASR_DPE (1U)          /*!< Bit position for CAU_RADR_CASR_DPE. */
#define BM_CAU_RADR_CASR_DPE (0x00000002U) /*!< Bit mask for CAU_RADR_CASR_DPE. */
#define BS_CAU_RADR_CASR_DPE (1U)          /*!< Bit field size in bits for CAU_RADR_CASR_DPE. */

/*! @brief Format value for bitfield CAU_RADR_CASR_DPE. */
#define BF_CAU_RADR_CASR_DPE(v) ((uint32_t)((uint32_t)(v) << BP_CAU_RADR_CASR_DPE) & BM_CAU_RADR_CASR_DPE)
/*@}*/

/*!
 * @name Register CAU_RADR_CASR, field VER[31:28] (WO)
 *
 * Values:
 * - 0001 - Initial CAU version
 * - 0010 - Second version, added support for SHA-256 algorithm.(This is the
 *     value on this device)
 */
/*@{*/
#define BP_CAU_RADR_CASR_VER (28U)         /*!< Bit position for CAU_RADR_CASR_VER. */
#define BM_CAU_RADR_CASR_VER (0xF0000000U) /*!< Bit mask for CAU_RADR_CASR_VER. */
#define BS_CAU_RADR_CASR_VER (4U)          /*!< Bit field size in bits for CAU_RADR_CASR_VER. */

/*! @brief Format value for bitfield CAU_RADR_CASR_VER. */
#define BF_CAU_RADR_CASR_VER(v) ((uint32_t)((uint32_t)(v) << BP_CAU_RADR_CASR_VER) & BM_CAU_RADR_CASR_VER)
/*@}*/

