smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*******************************************************************************
 * HW_CAU_XOR_CA5 - General Purpose Register 5 - Exclusive Or command
 ******************************************************************************/

/*!
 * @brief HW_CAU_XOR_CA5 - General Purpose Register 5 - Exclusive Or command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_xor_ca5
{
    uint32_t U;
    struct _hw_cau_xor_ca5_bitfields
    {
        uint32_t CA5 : 32;             /*!< [31:0] CA5 */
    } B;
} hw_cau_xor_ca5_t;

/*!
 * @name Constants and macros for entire CAU_XOR_CA5 register
 */
/*@{*/
#define HW_CAU_XOR_CA5_ADDR(x)   ((uintptr_t)(x) + 0x99CU)

#define HW_CAU_XOR_CA5(x)        (*(__O hw_cau_xor_ca5_t *) HW_CAU_XOR_CA5_ADDR(x))
#define HW_CAU_XOR_CA5_WR(x, v)  (HW_CAU_XOR_CA5(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_XOR_CA5 bitfields
 */

/*!
 * @name Register CAU_XOR_CA5, field CA5[31:0] (WO)
 */
/*@{*/
#define BP_CAU_XOR_CA5_CA5   (0U)          /*!< Bit position for CAU_XOR_CA5_CA5. */
#define BM_CAU_XOR_CA5_CA5   (0xFFFFFFFFU) /*!< Bit mask for CAU_XOR_CA5_CA5. */
#define BS_CAU_XOR_CA5_CA5   (32U)         /*!< Bit field size in bits for CAU_XOR_CA5_CA5. */

/*! @brief Format value for bitfield CAU_XOR_CA5_CA5. */
#define BF_CAU_XOR_CA5_CA5(v) ((uint32_t)((uint32_t)(v) << BP_CAU_XOR_CA5_CA5) & BM_CAU_XOR_CA5_CA5)
/*@}*/

/*******************************************************************************
 * HW_CAU_XOR_CA6 - General Purpose Register 6 - Exclusive Or command
 ******************************************************************************/

/*!
 * @brief HW_CAU_XOR_CA6 - General Purpose Register 6 - Exclusive Or command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_xor_ca6
{
    uint32_t U;
    struct _hw_cau_xor_ca6_bitfields
    {
        uint32_t CA6 : 32;             /*!< [31:0] CA6 */
    } B;
} hw_cau_xor_ca6_t;

/*!
 * @name Constants and macros for entire CAU_XOR_CA6 register
 */
/*@{*/
#define HW_CAU_XOR_CA6_ADDR(x)   ((uintptr_t)(x) + 0x9A0U)

#define HW_CAU_XOR_CA6(x)        (*(__O hw_cau_xor_ca6_t *) HW_CAU_XOR_CA6_ADDR(x))
#define HW_CAU_XOR_CA6_WR(x, v)  (HW_CAU_XOR_CA6(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_XOR_CA6 bitfields
 */

/*!
 * @name Register CAU_XOR_CA6, field CA6[31:0] (WO)
 */
/*@{*/
#define BP_CAU_XOR_CA6_CA6   (0U)          /*!< Bit position for CAU_XOR_CA6_CA6. */
#define BM_CAU_XOR_CA6_CA6   (0xFFFFFFFFU) /*!< Bit mask for CAU_XOR_CA6_CA6. */
#define BS_CAU_XOR_CA6_CA6   (32U)         /*!< Bit field size in bits for CAU_XOR_CA6_CA6. */

/*! @brief Format value for bitfield CAU_XOR_CA6_CA6. */
#define BF_CAU_XOR_CA6_CA6(v) ((uint32_t)((uint32_t)(v) << BP_CAU_XOR_CA6_CA6) & BM_CAU_XOR_CA6_CA6)
/*@}*/

/*******************************************************************************
 * HW_CAU_XOR_CA7 - General Purpose Register 7 - Exclusive Or command
 ******************************************************************************/

/*!
 * @brief HW_CAU_XOR_CA7 - General Purpose Register 7 - Exclusive Or command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_xor_ca7
{
    uint32_t U;
    struct _hw_cau_xor_ca7_bitfields
    {
        uint32_t CA7 : 32;             /*!< [31:0] CA7 */
    } B;
} hw_cau_xor_ca7_t;

/*!
 * @name Constants and macros for entire CAU_XOR_CA7 register
 */
/*@{*/
#define HW_CAU_XOR_CA7_ADDR(x)   ((uintptr_t)(x) + 0x9A4U)

#define HW_CAU_XOR_CA7(x)        (*(__O hw_cau_xor_ca7_t *) HW_CAU_XOR_CA7_ADDR(x))
#define HW_CAU_XOR_CA7_WR(x, v)  (HW_CAU_XOR_CA7(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_XOR_CA7 bitfields
 */

/*!
 * @name Register CAU_XOR_CA7, field CA7[31:0] (WO)
 */
/*@{*/
#define BP_CAU_XOR_CA7_CA7   (0U)          /*!< Bit position for CAU_XOR_CA7_CA7. */
#define BM_CAU_XOR_CA7_CA7   (0xFFFFFFFFU) /*!< Bit mask for CAU_XOR_CA7_CA7. */
#define BS_CAU_XOR_CA7_CA7   (32U)         /*!< Bit field size in bits for CAU_XOR_CA7_CA7. */

/*! @brief Format value for bitfield CAU_XOR_CA7_CA7. */
#define BF_CAU_XOR_CA7_CA7(v) ((uint32_t)((uint32_t)(v) << BP_CAU_XOR_CA7_CA7) & BM_CAU_XOR_CA7_CA7)
/*@}*/

/*******************************************************************************
 * HW_CAU_XOR_CA8 - General Purpose Register 8 - Exclusive Or command
 ******************************************************************************/

/*!
 * @brief HW_CAU_XOR_CA8 - General Purpose Register 8 - Exclusive Or command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_xor_ca8
{
    uint32_t U;
    struct _hw_cau_xor_ca8_bitfields
    {
        uint32_t CA8 : 32;             /*!< [31:0] CA8 */
    } B;
} hw_cau_xor_ca8_t;

/*!
 * @name Constants and macros for entire CAU_XOR_CA8 register
 */
/*@{*/
#define HW_CAU_XOR_CA8_ADDR(x)   ((uintptr_t)(x) + 0x9A8U)

#define HW_CAU_XOR_CA8(x)        (*(__O hw_cau_xor_ca8_t *) HW_CAU_XOR_CA8_ADDR(x))
#define HW_CAU_XOR_CA8_WR(x, v)  (HW_CAU_XOR_CA8(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_XOR_CA8 bitfields
 */

/*!
 * @name Register CAU_XOR_CA8, field CA8[31:0] (WO)
 */
/*@{*/
#define BP_CAU_XOR_CA8_CA8   (0U)          /*!< Bit position for CAU_XOR_CA8_CA8. */
#define BM_CAU_XOR_CA8_CA8   (0xFFFFFFFFU) /*!< Bit mask for CAU_XOR_CA8_CA8. */
#define BS_CAU_XOR_CA8_CA8   (32U)         /*!< Bit field size in bits for CAU_XOR_CA8_CA8. */

/*! @brief Format value for bitfield CAU_XOR_CA8_CA8. */
#define BF_CAU_XOR_CA8_CA8(v) ((uint32_t)((uint32_t)(v) << BP_CAU_XOR_CA8_CA8) & BM_CAU_XOR_CA8_CA8)
/*@}*/

/*******************************************************************************
 * HW_CAU_ROTL_CASR - Status register  - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CASR - Status register  - Rotate Left command (WO)
 *
 * Reset value: 0x20000000U
 */
typedef union _hw_cau_rotl_casr
{
    uint32_t U;
    struct _hw_cau_rotl_casr_bitfields
    {
        uint32_t IC : 1;               /*!< [0]  */
        uint32_t DPE : 1;              /*!< [1]  */
        uint32_t RESERVED0 : 26;       /*!< [27:2]  */
        uint32_t VER : 4;              /*!< [31:28] CAU version */
    } B;
} hw_cau_rotl_casr_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CASR register
 */
/*@{*/
#define HW_CAU_ROTL_CASR_ADDR(x) ((uintptr_t)(x) + 0x9C0U)

#define HW_CAU_ROTL_CASR(x)      (*(__O hw_cau_rotl_casr_t *) HW_CAU_ROTL_CASR_ADDR(x))
#define HW_CAU_ROTL_CASR_WR(x, v) (HW_CAU_ROTL_CASR(x).U = (v))
/*@}*/

