smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*******************************************************************************
 * HW_CAU_AESC_CA3 - General Purpose Register 3 - AES Column Operation command
 ******************************************************************************/

/*!
 * @brief HW_CAU_AESC_CA3 - General Purpose Register 3 - AES Column Operation command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_aesc_ca3
{
    uint32_t U;
    struct _hw_cau_aesc_ca3_bitfields
    {
        uint32_t CA3 : 32;             /*!< [31:0] CA3 */
    } B;
} hw_cau_aesc_ca3_t;

/*!
 * @name Constants and macros for entire CAU_AESC_CA3 register
 */
/*@{*/
#define HW_CAU_AESC_CA3_ADDR(x)  ((uintptr_t)(x) + 0xB14U)

#define HW_CAU_AESC_CA3(x)       (*(__O hw_cau_aesc_ca3_t *) HW_CAU_AESC_CA3_ADDR(x))
#define HW_CAU_AESC_CA3_WR(x, v) (HW_CAU_AESC_CA3(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_AESC_CA3 bitfields
 */

/*!
 * @name Register CAU_AESC_CA3, field CA3[31:0] (WO)
 */
/*@{*/
#define BP_CAU_AESC_CA3_CA3  (0U)          /*!< Bit position for CAU_AESC_CA3_CA3. */
#define BM_CAU_AESC_CA3_CA3  (0xFFFFFFFFU) /*!< Bit mask for CAU_AESC_CA3_CA3. */
#define BS_CAU_AESC_CA3_CA3  (32U)         /*!< Bit field size in bits for CAU_AESC_CA3_CA3. */

/*! @brief Format value for bitfield CAU_AESC_CA3_CA3. */
#define BF_CAU_AESC_CA3_CA3(v) ((uint32_t)((uint32_t)(v) << BP_CAU_AESC_CA3_CA3) & BM_CAU_AESC_CA3_CA3)
/*@}*/

/*******************************************************************************
 * HW_CAU_AESC_CA4 - General Purpose Register 4 - AES Column Operation command
 ******************************************************************************/

/*!
 * @brief HW_CAU_AESC_CA4 - General Purpose Register 4 - AES Column Operation command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_aesc_ca4
{
    uint32_t U;
    struct _hw_cau_aesc_ca4_bitfields
    {
        uint32_t CA4 : 32;             /*!< [31:0] CA4 */
    } B;
} hw_cau_aesc_ca4_t;

/*!
 * @name Constants and macros for entire CAU_AESC_CA4 register
 */
/*@{*/
#define HW_CAU_AESC_CA4_ADDR(x)  ((uintptr_t)(x) + 0xB18U)

#define HW_CAU_AESC_CA4(x)       (*(__O hw_cau_aesc_ca4_t *) HW_CAU_AESC_CA4_ADDR(x))
#define HW_CAU_AESC_CA4_WR(x, v) (HW_CAU_AESC_CA4(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_AESC_CA4 bitfields
 */

/*!
 * @name Register CAU_AESC_CA4, field CA4[31:0] (WO)
 */
/*@{*/
#define BP_CAU_AESC_CA4_CA4  (0U)          /*!< Bit position for CAU_AESC_CA4_CA4. */
#define BM_CAU_AESC_CA4_CA4  (0xFFFFFFFFU) /*!< Bit mask for CAU_AESC_CA4_CA4. */
#define BS_CAU_AESC_CA4_CA4  (32U)         /*!< Bit field size in bits for CAU_AESC_CA4_CA4. */

/*! @brief Format value for bitfield CAU_AESC_CA4_CA4. */
#define BF_CAU_AESC_CA4_CA4(v) ((uint32_t)((uint32_t)(v) << BP_CAU_AESC_CA4_CA4) & BM_CAU_AESC_CA4_CA4)
/*@}*/

/*******************************************************************************
 * HW_CAU_AESC_CA5 - General Purpose Register 5 - AES Column Operation command
 ******************************************************************************/

/*!
 * @brief HW_CAU_AESC_CA5 - General Purpose Register 5 - AES Column Operation command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_aesc_ca5
{
    uint32_t U;
    struct _hw_cau_aesc_ca5_bitfields
    {
        uint32_t CA5 : 32;             /*!< [31:0] CA5 */
    } B;
} hw_cau_aesc_ca5_t;

/*!
 * @name Constants and macros for entire CAU_AESC_CA5 register
 */
/*@{*/
#define HW_CAU_AESC_CA5_ADDR(x)  ((uintptr_t)(x) + 0xB1CU)

#define HW_CAU_AESC_CA5(x)       (*(__O hw_cau_aesc_ca5_t *) HW_CAU_AESC_CA5_ADDR(x))
#define HW_CAU_AESC_CA5_WR(x, v) (HW_CAU_AESC_CA5(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_AESC_CA5 bitfields
 */

/*!
 * @name Register CAU_AESC_CA5, field CA5[31:0] (WO)
 */
/*@{*/
#define BP_CAU_AESC_CA5_CA5  (0U)          /*!< Bit position for CAU_AESC_CA5_CA5. */
#define BM_CAU_AESC_CA5_CA5  (0xFFFFFFFFU) /*!< Bit mask for CAU_AESC_CA5_CA5. */
#define BS_CAU_AESC_CA5_CA5  (32U)         /*!< Bit field size in bits for CAU_AESC_CA5_CA5. */

/*! @brief Format value for bitfield CAU_AESC_CA5_CA5. */
#define BF_CAU_AESC_CA5_CA5(v) ((uint32_t)((uint32_t)(v) << BP_CAU_AESC_CA5_CA5) & BM_CAU_AESC_CA5_CA5)
/*@}*/

/*******************************************************************************
 * HW_CAU_AESC_CA6 - General Purpose Register 6 - AES Column Operation command
 ******************************************************************************/

/*!
 * @brief HW_CAU_AESC_CA6 - General Purpose Register 6 - AES Column Operation command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_aesc_ca6
{
    uint32_t U;
    struct _hw_cau_aesc_ca6_bitfields
    {
        uint32_t CA6 : 32;             /*!< [31:0] CA6 */
    } B;
} hw_cau_aesc_ca6_t;

/*!
 * @name Constants and macros for entire CAU_AESC_CA6 register
 */
/*@{*/
#define HW_CAU_AESC_CA6_ADDR(x)  ((uintptr_t)(x) + 0xB20U)

#define HW_CAU_AESC_CA6(x)       (*(__O hw_cau_aesc_ca6_t *) HW_CAU_AESC_CA6_ADDR(x))
#define HW_CAU_AESC_CA6_WR(x, v) (HW_CAU_AESC_CA6(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_AESC_CA6 bitfields
 */

/*!
 * @name Register CAU_AESC_CA6, field CA6[31:0] (WO)
 */
/*@{*/
#define BP_CAU_AESC_CA6_CA6  (0U)          /*!< Bit position for CAU_AESC_CA6_CA6. */
#define BM_CAU_AESC_CA6_CA6  (0xFFFFFFFFU) /*!< Bit mask for CAU_AESC_CA6_CA6. */
#define BS_CAU_AESC_CA6_CA6  (32U)         /*!< Bit field size in bits for CAU_AESC_CA6_CA6. */

/*! @brief Format value for bitfield CAU_AESC_CA6_CA6. */
#define BF_CAU_AESC_CA6_CA6(v) ((uint32_t)((uint32_t)(v) << BP_CAU_AESC_CA6_CA6) & BM_CAU_AESC_CA6_CA6)
/*@}*/

/*******************************************************************************
 * HW_CAU_AESC_CA7 - General Purpose Register 7 - AES Column Operation command
 ******************************************************************************/

/*!
 * @brief HW_CAU_AESC_CA7 - General Purpose Register 7 - AES Column Operation command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_aesc_ca7
{
    uint32_t U;
    struct _hw_cau_aesc_ca7_bitfields
    {
        uint32_t CA7 : 32;             /*!< [31:0] CA7 */
    } B;
} hw_cau_aesc_ca7_t;

/*!
 * @name Constants and macros for entire CAU_AESC_CA7 register
 */
/*@{*/
#define HW_CAU_AESC_CA7_ADDR(x)  ((uintptr_t)(x) + 0xB24U)

#define HW_CAU_AESC_CA7(x)       (*(__O hw_cau_aesc_ca7_t *) HW_CAU_AESC_CA7_ADDR(x))
#define HW_CAU_AESC_CA7_WR(x, v) (HW_CAU_AESC_CA7(x).U = (v))
/*@}*/

