smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*! @brief Macro to access all FMC registers. */
/*! @param x FMC module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_FMC_REGS(FMC_BASE)</code>. */
#define HW_FMC_REGS(x) (*(hw_fmc_t *)(x))

/*
 * MK11DA5 FTFL
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - HW_FTFL_FSTAT - Flash Status Register
 * - HW_FTFL_FCNFG - Flash Configuration Register
 * - HW_FTFL_FSEC - Flash Security Register
 * - HW_FTFL_FOPT - Flash Option Register
 * - HW_FTFL_FCCOB3 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB2 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB1 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB0 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB7 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB6 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB5 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB4 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOBB - Flash Common Command Object Registers
 * - HW_FTFL_FCCOBA - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB9 - Flash Common Command Object Registers
 * - HW_FTFL_FCCOB8 - Flash Common Command Object Registers
 * - HW_FTFL_FPROT3 - Program Flash Protection Registers
 * - HW_FTFL_FPROT2 - Program Flash Protection Registers
 * - HW_FTFL_FPROT1 - Program Flash Protection Registers
 * - HW_FTFL_FPROT0 - Program Flash Protection Registers
 * - HW_FTFL_FEPROT - EEPROM Protection Register
 * - HW_FTFL_FDPROT - Data Flash Protection Register
 *
 * - hw_ftfl_t - Struct containing all module registers.
 */

#define HW_FTFL_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFL module. */
#define HW_FTFL (0U) /*!< Instance number for FTFL. */

/*******************************************************************************
 * HW_FTFL_FSTAT - Flash Status Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FSTAT - Flash Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FSTAT register reports the operational status of the flash memory module.
 * The CCIF, RDCOLERR, ACCERR, and FPVIOL bits are readable and writable. The
 * MGSTAT0 bit is read only. The unassigned bits read 0 and are not writable. When
 * set, the Access Error (ACCERR) and Flash Protection Violation (FPVIOL) bits in
 * this register prevent the launch of any more commands or writes to the
 * FlexRAM (when EEERDY is set) until the flag is cleared (by writing a one to it).
 */
typedef union _hw_ftfl_fstat
{
    uint8_t U;
    struct _hw_ftfl_fstat_bitfields
    {
        uint8_t MGSTAT0 : 1;           /*!< [0] Memory Controller Command Completion
                                        * Status Flag */
        uint8_t RESERVED0 : 3;         /*!< [3:1]  */
        uint8_t FPVIOL : 1;            /*!< [4] Flash Protection Violation Flag */
        uint8_t ACCERR : 1;            /*!< [5] Flash Access Error Flag */
        uint8_t RDCOLERR : 1;          /*!< [6] Flash Read Collision Error Flag */
        uint8_t CCIF : 1;              /*!< [7] Command Complete Interrupt Flag */
    } B;
} hw_ftfl_fstat_t;

/*!
 * @name Constants and macros for entire FTFL_FSTAT register
 */
/*@{*/
#define HW_FTFL_FSTAT_ADDR(x)    ((uintptr_t)(x) + 0x0U)

#define HW_FTFL_FSTAT(x)         (*(__IO hw_ftfl_fstat_t *) HW_FTFL_FSTAT_ADDR(x))
#define HW_FTFL_FSTAT_RD(x)      (HW_FTFL_FSTAT(x).U)
#define HW_FTFL_FSTAT_WR(x, v)   (HW_FTFL_FSTAT(x).U = (v))
#define HW_FTFL_FSTAT_SET(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) |  (v)))
#define HW_FTFL_FSTAT_CLR(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) & ~(v)))
#define HW_FTFL_FSTAT_TOG(x, v)  (HW_FTFL_FSTAT_WR(x, HW_FTFL_FSTAT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FSTAT bitfields
 */

/*!
 * @name Register FTFL_FSTAT, field MGSTAT0[0] (RO)
 *
 * The MGSTAT0 status flag is set if an error is detected during execution of a
 * flash command or during the flash reset sequence. As a status flag, this field
 * cannot (and need not) be cleared by the user like the other error flags in
 * this register. The value of the MGSTAT0 bit for "command-N" is valid only at the
 * end of the "command-N" execution when CCIF=1 and before the next command has
 * been launched. At some point during the execution of "command-N+1," the
 * previous result is discarded and any previous error is cleared.
 */
/*@{*/
#define BP_FTFL_FSTAT_MGSTAT0 (0U)         /*!< Bit position for FTFL_FSTAT_MGSTAT0. */
#define BM_FTFL_FSTAT_MGSTAT0 (0x01U)      /*!< Bit mask for FTFL_FSTAT_MGSTAT0. */
#define BS_FTFL_FSTAT_MGSTAT0 (1U)         /*!< Bit field size in bits for FTFL_FSTAT_MGSTAT0. */

/*! @brief Read current value of the FTFL_FSTAT_MGSTAT0 field. */
#define BR_FTFL_FSTAT_MGSTAT0(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_MGSTAT0))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field FPVIOL[4] (W1C)
 *
 * Indicates an attempt was made to program or erase an address in a protected
 * area of program flash or data flash memory during a command write sequence or a
 * write was attempted to a protected area of the FlexRAM while enabled for
 * EEPROM. While FPVIOL is set, the CCIF flag cannot be cleared to launch a command.
 * The FPVIOL bit is cleared by writing a 1 to it. Writing a 0 to the FPVIOL bit
 * has no effect.
 *
 * Values:
 * - 0 - No protection violation detected
 * - 1 - Protection violation detected
 */
/*@{*/
#define BP_FTFL_FSTAT_FPVIOL (4U)          /*!< Bit position for FTFL_FSTAT_FPVIOL. */
#define BM_FTFL_FSTAT_FPVIOL (0x10U)       /*!< Bit mask for FTFL_FSTAT_FPVIOL. */
#define BS_FTFL_FSTAT_FPVIOL (1U)          /*!< Bit field size in bits for FTFL_FSTAT_FPVIOL. */

/*! @brief Read current value of the FTFL_FSTAT_FPVIOL field. */
#define BR_FTFL_FSTAT_FPVIOL(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_FPVIOL))

