smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*! @brief Read current value of the RTC_LR_TTSL field. */
#define BR_RTC_LR_TTSL(x)    (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_TTSL))

/*! @brief Format value for bitfield RTC_LR_TTSL. */
#define BF_RTC_LR_TTSL(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_LR_TTSL) & BM_RTC_LR_TTSL)

/*! @brief Set the TTSL field to a new value. */
#define BW_RTC_LR_TTSL(x, v) (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_TTSL) = (v))
/*@}*/

/*!
 * @name Register RTC_LR, field MEL[9] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Monotonic Enable Register is locked and writes are ignored.
 * - 1 - Monotonic Enable Register is not locked and writes complete as normal.
 */
/*@{*/
#define BP_RTC_LR_MEL        (9U)          /*!< Bit position for RTC_LR_MEL. */
#define BM_RTC_LR_MEL        (0x00000200U) /*!< Bit mask for RTC_LR_MEL. */
#define BS_RTC_LR_MEL        (1U)          /*!< Bit field size in bits for RTC_LR_MEL. */

/*! @brief Read current value of the RTC_LR_MEL field. */
#define BR_RTC_LR_MEL(x)     (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MEL))

/*! @brief Format value for bitfield RTC_LR_MEL. */
#define BF_RTC_LR_MEL(v)     ((uint32_t)((uint32_t)(v) << BP_RTC_LR_MEL) & BM_RTC_LR_MEL)

/*! @brief Set the MEL field to a new value. */
#define BW_RTC_LR_MEL(x, v)  (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MEL) = (v))
/*@}*/

/*!
 * @name Register RTC_LR, field MCLL[10] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Monotonic Counter Low Register is locked and writes are ignored.
 * - 1 - Monotonic Counter Low Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
#define BP_RTC_LR_MCLL       (10U)         /*!< Bit position for RTC_LR_MCLL. */
#define BM_RTC_LR_MCLL       (0x00000400U) /*!< Bit mask for RTC_LR_MCLL. */
#define BS_RTC_LR_MCLL       (1U)          /*!< Bit field size in bits for RTC_LR_MCLL. */

/*! @brief Read current value of the RTC_LR_MCLL field. */
#define BR_RTC_LR_MCLL(x)    (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MCLL))

/*! @brief Format value for bitfield RTC_LR_MCLL. */
#define BF_RTC_LR_MCLL(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_LR_MCLL) & BM_RTC_LR_MCLL)

/*! @brief Set the MCLL field to a new value. */
#define BW_RTC_LR_MCLL(x, v) (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MCLL) = (v))
/*@}*/

/*!
 * @name Register RTC_LR, field MCHL[11] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Monotonic Counter High Register is locked and writes are ignored.
 * - 1 - Monotonic Counter High Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
#define BP_RTC_LR_MCHL       (11U)         /*!< Bit position for RTC_LR_MCHL. */
#define BM_RTC_LR_MCHL       (0x00000800U) /*!< Bit mask for RTC_LR_MCHL. */
#define BS_RTC_LR_MCHL       (1U)          /*!< Bit field size in bits for RTC_LR_MCHL. */

/*! @brief Read current value of the RTC_LR_MCHL field. */
#define BR_RTC_LR_MCHL(x)    (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MCHL))

/*! @brief Format value for bitfield RTC_LR_MCHL. */
#define BF_RTC_LR_MCHL(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_LR_MCHL) & BM_RTC_LR_MCHL)

/*! @brief Set the MCHL field to a new value. */
#define BW_RTC_LR_MCHL(x, v) (BITBAND_ACCESS32(HW_RTC_LR_ADDR(x), BP_RTC_LR_MCHL) = (v))
/*@}*/

/*******************************************************************************
 * HW_RTC_IER - RTC Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_IER - RTC Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000007U
 */
typedef union _hw_rtc_ier
{
    uint32_t U;
    struct _hw_rtc_ier_bitfields
    {
        uint32_t TIIE : 1;             /*!< [0] Time Invalid Interrupt Enable */
        uint32_t TOIE : 1;             /*!< [1] Time Overflow Interrupt Enable */
        uint32_t TAIE : 1;             /*!< [2] Time Alarm Interrupt Enable */
        uint32_t MOIE : 1;             /*!< [3] Monotonic Overflow Interrupt Enable */
        uint32_t TSIE : 1;             /*!< [4] Time Seconds Interrupt Enable */
        uint32_t RESERVED0 : 2;        /*!< [6:5]  */
        uint32_t WPON : 1;             /*!< [7] Wakeup Pin On */
        uint32_t RESERVED1 : 24;       /*!< [31:8]  */
    } B;
} hw_rtc_ier_t;

/*!
 * @name Constants and macros for entire RTC_IER register
 */
/*@{*/
#define HW_RTC_IER_ADDR(x)       ((uintptr_t)(x) + 0x1CU)

#define HW_RTC_IER(x)            (*(__IO hw_rtc_ier_t *) HW_RTC_IER_ADDR(x))
#define HW_RTC_IER_RD(x)         (HW_RTC_IER(x).U)
#define HW_RTC_IER_WR(x, v)      (HW_RTC_IER(x).U = (v))
#define HW_RTC_IER_SET(x, v)     (HW_RTC_IER_WR(x, HW_RTC_IER_RD(x) |  (v)))
#define HW_RTC_IER_CLR(x, v)     (HW_RTC_IER_WR(x, HW_RTC_IER_RD(x) & ~(v)))
#define HW_RTC_IER_TOG(x, v)     (HW_RTC_IER_WR(x, HW_RTC_IER_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual RTC_IER bitfields
 */

/*!
 * @name Register RTC_IER, field TIIE[0] (RW)
 *
 * Values:
 * - 0 - Time invalid flag does not generate an interrupt.
 * - 1 - Time invalid flag does generate an interrupt.
 */
/*@{*/
#define BP_RTC_IER_TIIE      (0U)          /*!< Bit position for RTC_IER_TIIE. */
#define BM_RTC_IER_TIIE      (0x00000001U) /*!< Bit mask for RTC_IER_TIIE. */
#define BS_RTC_IER_TIIE      (1U)          /*!< Bit field size in bits for RTC_IER_TIIE. */

/*! @brief Read current value of the RTC_IER_TIIE field. */
#define BR_RTC_IER_TIIE(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TIIE))

/*! @brief Format value for bitfield RTC_IER_TIIE. */
#define BF_RTC_IER_TIIE(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_TIIE) & BM_RTC_IER_TIIE)

/*! @brief Set the TIIE field to a new value. */
#define BW_RTC_IER_TIIE(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TIIE) = (v))
/*@}*/

/*!
 * @name Register RTC_IER, field TOIE[1] (RW)
 *
 * Values:
 * - 0 - Time overflow flag does not generate an interrupt.
 * - 1 - Time overflow flag does generate an interrupt.
 */
/*@{*/
#define BP_RTC_IER_TOIE      (1U)          /*!< Bit position for RTC_IER_TOIE. */
#define BM_RTC_IER_TOIE      (0x00000002U) /*!< Bit mask for RTC_IER_TOIE. */
#define BS_RTC_IER_TOIE      (1U)          /*!< Bit field size in bits for RTC_IER_TOIE. */

/*! @brief Read current value of the RTC_IER_TOIE field. */
#define BR_RTC_IER_TOIE(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TOIE))

