smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK11DA5/MK11DA5_registers.h
/*! @brief Read current value of the RTC_RAR_SRR field. */
#define BR_RTC_RAR_SRR(x)    (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_SRR))

/*! @brief Format value for bitfield RTC_RAR_SRR. */
#define BF_RTC_RAR_SRR(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_SRR) & BM_RTC_RAR_SRR)

/*! @brief Set the SRR field to a new value. */
#define BW_RTC_RAR_SRR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_SRR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field LRR[6] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Lock Register are ignored.
 * - 1 - Reads to the Lock Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_LRR       (6U)          /*!< Bit position for RTC_RAR_LRR. */
#define BM_RTC_RAR_LRR       (0x00000040U) /*!< Bit mask for RTC_RAR_LRR. */
#define BS_RTC_RAR_LRR       (1U)          /*!< Bit field size in bits for RTC_RAR_LRR. */

/*! @brief Read current value of the RTC_RAR_LRR field. */
#define BR_RTC_RAR_LRR(x)    (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_LRR))

/*! @brief Format value for bitfield RTC_RAR_LRR. */
#define BF_RTC_RAR_LRR(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_LRR) & BM_RTC_RAR_LRR)

/*! @brief Set the LRR field to a new value. */
#define BW_RTC_RAR_LRR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_LRR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field IERR[7] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Interrupt Enable Register are ignored.
 * - 1 - Reads to the Interrupt Enable Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_IERR      (7U)          /*!< Bit position for RTC_RAR_IERR. */
#define BM_RTC_RAR_IERR      (0x00000080U) /*!< Bit mask for RTC_RAR_IERR. */
#define BS_RTC_RAR_IERR      (1U)          /*!< Bit field size in bits for RTC_RAR_IERR. */

/*! @brief Read current value of the RTC_RAR_IERR field. */
#define BR_RTC_RAR_IERR(x)   (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_IERR))

/*! @brief Format value for bitfield RTC_RAR_IERR. */
#define BF_RTC_RAR_IERR(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_IERR) & BM_RTC_RAR_IERR)

/*! @brief Set the IERR field to a new value. */
#define BW_RTC_RAR_IERR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_IERR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field TTSR[8] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Tamper Time Seconds Register are ignored.
 * - 1 - Reads to the Tamper Time Seconds Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_TTSR      (8U)          /*!< Bit position for RTC_RAR_TTSR. */
#define BM_RTC_RAR_TTSR      (0x00000100U) /*!< Bit mask for RTC_RAR_TTSR. */
#define BS_RTC_RAR_TTSR      (1U)          /*!< Bit field size in bits for RTC_RAR_TTSR. */

/*! @brief Read current value of the RTC_RAR_TTSR field. */
#define BR_RTC_RAR_TTSR(x)   (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_TTSR))

/*! @brief Format value for bitfield RTC_RAR_TTSR. */
#define BF_RTC_RAR_TTSR(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_TTSR) & BM_RTC_RAR_TTSR)

/*! @brief Set the TTSR field to a new value. */
#define BW_RTC_RAR_TTSR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_TTSR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field MERR[9] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Monotonic Enable Register are ignored.
 * - 1 - Reads to the Monotonic Enable Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_MERR      (9U)          /*!< Bit position for RTC_RAR_MERR. */
#define BM_RTC_RAR_MERR      (0x00000200U) /*!< Bit mask for RTC_RAR_MERR. */
#define BS_RTC_RAR_MERR      (1U)          /*!< Bit field size in bits for RTC_RAR_MERR. */

/*! @brief Read current value of the RTC_RAR_MERR field. */
#define BR_RTC_RAR_MERR(x)   (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MERR))

/*! @brief Format value for bitfield RTC_RAR_MERR. */
#define BF_RTC_RAR_MERR(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_MERR) & BM_RTC_RAR_MERR)

/*! @brief Set the MERR field to a new value. */
#define BW_RTC_RAR_MERR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MERR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field MCLR[10] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Monotonic Counter Low Register are ignored.
 * - 1 - Reads to the Monotonic Counter Low Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_MCLR      (10U)         /*!< Bit position for RTC_RAR_MCLR. */
#define BM_RTC_RAR_MCLR      (0x00000400U) /*!< Bit mask for RTC_RAR_MCLR. */
#define BS_RTC_RAR_MCLR      (1U)          /*!< Bit field size in bits for RTC_RAR_MCLR. */

/*! @brief Read current value of the RTC_RAR_MCLR field. */
#define BR_RTC_RAR_MCLR(x)   (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MCLR))

/*! @brief Format value for bitfield RTC_RAR_MCLR. */
#define BF_RTC_RAR_MCLR(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_MCLR) & BM_RTC_RAR_MCLR)

/*! @brief Set the MCLR field to a new value. */
#define BW_RTC_RAR_MCLR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MCLR) = (v))
/*@}*/

/*!
 * @name Register RTC_RAR, field MCHR[11] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the Monotonic Counter High Register are ignored.
 * - 1 - Reads to the Monotonic Counter High Register complete as normal.
 */
/*@{*/
#define BP_RTC_RAR_MCHR      (11U)         /*!< Bit position for RTC_RAR_MCHR. */
#define BM_RTC_RAR_MCHR      (0x00000800U) /*!< Bit mask for RTC_RAR_MCHR. */
#define BS_RTC_RAR_MCHR      (1U)          /*!< Bit field size in bits for RTC_RAR_MCHR. */

/*! @brief Read current value of the RTC_RAR_MCHR field. */
#define BR_RTC_RAR_MCHR(x)   (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MCHR))

/*! @brief Format value for bitfield RTC_RAR_MCHR. */
#define BF_RTC_RAR_MCHR(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_RAR_MCHR) & BM_RTC_RAR_MCHR)

/*! @brief Set the MCHR field to a new value. */
#define BW_RTC_RAR_MCHR(x, v) (BITBAND_ACCESS32(HW_RTC_RAR_ADDR(x), BP_RTC_RAR_MCHR) = (v))
/*@}*/

